mdhardenburgh/Blinky/Packages/.cache/Keil.STM32MP1xx_DFP.1.1.0.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.4" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <url>http://www.keil.com/pack/</url>
  <name>STM32MP1xx_DFP</name>
  <description>STMicroelectronics STM32MP1 Series Device Support</description>

  <requirements>
    <packages>
      <package vendor="ARM" name="CMSIS" version="5.4.0"/> <!-- minVersion no maxVersion -->
      <package vendor="ARM" name="AMP"   version="1.1.0"/> <!-- minVersion no maxVersion -->
    </packages>
  </requirements>

  <releases>
    <release version="1.1.0" date="2019-07-22">
      Added STM32MP157C-DK2 Discovery board support and examples.
      Updated examples' core and trace clock configuration.
    </release>
    <release version="1.0.0" date="2019-04-15">
      Initial release of STM32MP1 Device Family Pack.
    </release>
  </releases>

  <keywords>
    <keyword>ST</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package STMicroelectronics</keyword>
    <keyword>STM32MP1</keyword>
    <keyword>STM32MP157</keyword>
  </keywords>

  <devices>
    <family Dfamily="STM32MP1 Series" Dvendor="STMicroelectronics:13">

      <subFamily DsubFamily="STM32MP157">

        <!-- ******************************  STM32MP157xxx  ******************************* -->

        <!-- Device processor attributes -->
        <processor Dcore="Cortex-A7" DcoreVersion="r0p5" Dfpu="DP_FPU" Dmpu="MPU" Pname="Cortex-A7" Punits="2" Dclock="650000000"/>
        <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="SP_FPU" Dmpu="MPU" Pname="Cortex-M4" Dclock="209000000"/>

        <!-- Debug configuration settings -->
        <debugconfig default="swd" swj="true" clock="10000000" sdf="Debug/STM32MP1.sdf"/>

        <debugvars configfile="Debug/STM32MP1.dbgconf">
          __var Production_Options = 0x00000000;   // Automation scripts disabled
          __var Force_M4_Start     = 0x00000000;   // Force M4 start disabled
          __var DbgMCU_CR          = 0x00000007;   // DBGMCU_CR: DBG_SLEEP, DBG_STOP, DBG_STANDBY
          
          __var TraceClk_Pin       = 0x0008000E;   // PI14
          __var TraceD0_Pin        = 0x0008000C;   // P112
          __var TraceD1_Pin        = 0x0008000D;   // PI13
          __var TraceD2_Pin        = 0x00090005;   // PJ5
          __var TraceD3_Pin        = 0x00090006;   // PJ6
        </debugvars>

        <description>
          STM32MP157 microprocessors are based on the flexible architecture of a Dual Arm Cortex-A7 core running at 650 MHz
          and Cortex-M4 at 209 MHz combined with a dedicated 3D graphics processing unit (GPU) and MIPI-DSI display interface
          and a CAN FD interface.

          Specifically designed to accelerate 3D graphics in applications such as graphical user interfaces (GUI),
          menu displays or animations, the STM32MP157 3D OpenGL ES 2.0 graphics engine works together with an optimized
          software stack design for industry-standard APIs with support for Android and Linux embedded development platforms.

          As well as an LCD-TFT display controller, the STM32MP157 line embeds up to 37 communication peripherals including
          10/100M or Gigabit Ethernet, 3x USB 2.0 Host/OTG, 29x Timers and Advanced Analog.

          In addition to true random number generators (TRNG), hardware cryptographic and hash processors, the security option
          includes Secure Boot, TrustZone peripherals, and an active tamper-detect feature.
        </description>

        <book name="https://www.st.com/resource/en/reference_manual/dm00327659.pdf" title="Reference Manual STM32MP157"/>
        <book name="https://www.st.com/resource/en/programming_manual/dm00046982.pdf" title="Programming Manual STM32"/>
        <book name="https://www.st.com/resource/en/datasheet/stm32mp157a.pdf" title="Datasheet STM32MP157A"/>
        <book name="https://www.st.com/resource/en/datasheet/stm32mp157c.pdf" title="Datasheet STM32MP157C"/>
        <book name="https://www.st.com/resource/en/errata_sheet/dm00516256.pdf" title="Errata STM32MP151x/3x/7x"/>

        <sequences>
          <!-- Override for Pre-Defined Sequences -->
          <sequence name="DebugDeviceUnlock">
            <block>
              __var value = 0;
              // Read RCC_DBGCFGR
              value = Read32(0x5000080C);
              // Enable Debug Clock
              value |= 0x00000100;
            </block>

            <control if="__traceout">
              <block>
                // Enable Trace Clock
                value |= 0x00000200;
              </block>
            </control>
            
            <block>
              Write32(0x50081004, DbgMCU_CR);                                                // Update DBGMCU_CR
              Write32(0x5000080C, value);                                                    // Update RCC_DBGCFGR
            </block>
          </sequence>

          <sequence name="TraceStart">
            <block>
              __var traceSWO    = (__traceout &amp; 0x1) != 0;                               // SWO (asynchronous) Trace Selected?
              __var traceTPIU   = (__traceout &amp; 0x2) != 0;                               // TPIU (synchronous) Trace Selected?
            </block>

            <control if="traceTPIU">
              <block>
                Sequence("ConfigureTraceTPIUPins");
              </block>
            </control>
          </sequence>

          <sequence name="DebugPortStart" Pname="Cortex-M4">
            <block>
              __var SW_DP_ABORT  = 0x0;
              __var DP_CTRL_STAT = 0x4;
              __var DP_SELECT    = 0x8;
              __var powered_down = 0;
              // Switch to DP Register Bank 0
              WriteDP(DP_SELECT, 0x00000000);

              // Read DP CTRL/STAT Register and check if CSYSPWRUPACK and CDBGPWRUPACK bits are set
              powered_down = ((ReadDP(DP_CTRL_STAT) &amp; 0xA0000000) != 0xA0000000);
            </block>

            <control if="powered_down">
              <block>
                // Request Debug/System Power-Up
                WriteDP(DP_CTRL_STAT, 0x50000000);
              </block>
              <!-- Wait for Power-Up Request to be acknowledged -->
              <control while="(ReadDP(DP_CTRL_STAT) &amp; 0xA0000000) != 0xA0000000" timeout="1000000"/>
              <!-- JTAG Specific Part of sequence -->
              <control if="(__protocol &amp; 0xFFFF) == 1">
                <block>
                  // Init AP Transfer Mode, Transaction Counter, and Lane Mask (Normal Transfer Mode, Include all Byte Lanes)
                  // Additionally clear STICKYORUN, STICKYCMP, and STICKYERR bits by writing '1'
                  WriteDP(DP_CTRL_STAT, 0x50000F32);
                </block>
              </control>

              <!-- SWD Specific Part of sequence -->
              <control if="(__protocol &amp; 0xFFFF) == 2">
                <block>
                  // Init AP Transfer Mode, Transaction Counter, and Lane Mask (Normal Transfer Mode, Include all Byte Lanes)
                  WriteDP(DP_CTRL_STAT, 0x50000F00);
                  // Clear WDATAERR, STICKYORUN, STICKYCMP, and STICKYERR bits of CTRL/STAT Register by write to ABORT register
                  WriteDP(SW_DP_ABORT, 0x0000001E);
                </block>
              </control>
            </control>

