mdhardenburgh/Blinky/Packages/.cache/Keil.STM32MP1xx_DFP.1.1.0.pdsc
            <control if="Force_M4_Start &amp; 0x00000001">
              <block>
                // Set BOOT_MCU bit in RCC_MP_GCR register via AXI-AP
                __ap =  0x0;
                Write32(0x5000010C, Read32(0x5000010C)|0x1);

                // Start M4 and leave it running on an endless loop
                __ap =  0x2;
                Write32(0x00000000, 0x00001000); // Initial SP
                Write32(0x00000004, 0x00000009); // Initial PC
                Write32(0x00000008, 0x0000E7FE); // Endless loop
                Write32(0xE000ED0C, 0x05FA0004); // Reset
              </block>
            </control>

            <block>
              // Read boot mode from SYSCFG->BOOTR register
              __ap =  0x0;
              __var boot_mode = Read32(0x50020000) &amp; 0x00000007;
            </block>

            <control if="(Production_Options &amp; 0x00000001) &amp;&amp; (boot_mode != 0x00000004)">
              <block>
                __var exitCode = 0;
                exitCode = RunApplication ("$STools/start.bat", "$STools $D %L", "$P", 15000000);  // Timeout is 15 seconds
              </block>

              <control if="exitCode == 0">
                <block>
                  // Set BOOT_MCU bit in RCC_MP_GCR register via AXI-AP
                  __ap =  0x0;
                  Write32(0x5000010C, Read32(0x5000010C)|0x1);
                </block>
              </control>
              <control if="(exitCode != 0)">
                <block>
                  Message(2, "Error while calling start script. Aborting sequence.");
                </block>
              </control>
            </control>
          </sequence>

          <sequence name="DebugPortStop" Pname="Cortex-M4">
            <block>
              // Read boot mode from SYSCFG->BOOTR register
              __ap =  0x0;
              __var boot_mode = Read32(0x50020000) &amp; 0x00000007;
            </block>

            <block>
              __var DP_CTRL_STAT = 0x4;
              __var DP_SELECT    = 0x8;

              // Switch to DP Register Bank 0
              WriteDP(DP_SELECT, 0x00000000);

              // Power Down Debug port
              WriteDP(DP_CTRL_STAT, 0x00000000);
            </block>

            <control if="(Production_Options &amp; 0x00000002) &amp;&amp; (boot_mode != 0x00000004)">
              <block>
                __var exitCode = 0;
                exitCode = RunApplication ("$STools/stop.bat", "$STools $D %L", "$P", 15000000);  // Timeout is 15 seconds
              </block>
              <control if="(exitCode != 0)">
                <block>
                  Message(2, "Error while calling stop script. Aborting sequence.");
                </block>
              </control>
            </control>
          </sequence>

          <sequence name="ResetSystem" Pname="Cortex-M4">
            <block>
              // System Control Space (SCS) offset as defined in Armv6-M/Armv7-M.
              __var SCS_Addr   = 0xE000E000;
              __var AIRCR_Addr = SCS_Addr + 0xD0C;
              __var DHCSR_Addr = SCS_Addr + 0xDF0;
            
              // Execute SYSRESETREQ via AIRCR
              Write32(AIRCR_Addr, 0x05FA0004);
            </block>
            <!-- Reset Recovery: Wait for DHCSR.S_RESET_ST bit to clear on read -->
            <control while="(Read32(DHCSR_Addr) &amp; 0x02000000)" timeout="500000"/>

            <block>
              // Read boot mode from SYSCFG->BOOTR register
              __ap =  0x0;
              __var boot_mode = Read32(0x50020000) &amp; 0x00000007;
            </block>

            <control if="(Production_Options &amp; 0x00000004) &amp;&amp; (boot_mode != 0x00000004)">
              <block>
                __var exitCode = 0;
                exitCode = RunApplication ("$STools/restart.bat", "$STools $D", "$P", 15000000);  // Timeout is 15 seconds
              </block>
              <control if="(exitCode != 0)">
                <block>
                  Message(2, "Error while calling reset script. Aborting sequence.");
                </block>
              </control>
            </control>
          </sequence>
          
          <sequence name="ConfigureTraceTPIUPins">
            <block>
              __var pin     = 8;
              __var port    = 0;
              __var portAdr = 0;
              __var pos     = 0;
              __var MCU_AHB4_PERIPH_BASE = 0x50000000;
              __var RCC_MC_AHB4ENSETR = MCU_AHB4_PERIPH_BASE + 0x00000AA8;

              __var width   = (__traceout &amp; 0x003F0000) &gt;&gt; 16;
            </block>

            <!-- configure TRACECLK -->
            <block info="configure TRACECLK">
              pin     =                          (TraceClk_Pin            ) &amp; 0x0000FFFF;
              port    =                          (TraceClk_Pin &gt;&gt; 16) &amp; 0x0000FFFF;
              portAdr = MCU_AHB4_PERIPH_BASE + (((TraceClk_Pin &gt;&gt; 4 ) &amp; 0x0000F000) + 0x00002000);

              pos = pin * 2;
              Write32(RCC_MC_AHB4ENSETR, ((Read32(RCC_MC_AHB4ENSETR)                      ) | (1 &lt;&lt; port)) );  // RCC_MC_AHB4ENSETR: IO port clock enable
              Write32(portAdr + 0x00,    ((Read32(portAdr + 0x00) &amp; ~( 3 &lt;&lt; pos)) | (2 &lt;&lt; pos )) );  // GPIOx_MODER:       Set Mode (Alternate Function)
              Write32(portAdr + 0x08,    ((Read32(portAdr + 0x08)                         ) | (3 &lt;&lt; pos )) );  // GPIOx_OSPEEDR:     Set Speed (Very High Speed)
              Write32(portAdr + 0x0C,    ((Read32(portAdr + 0x0C) &amp; ~( 3 &lt;&lt; pos))                    ) );  // GPIOx_PUPDR:       Set I/O to no pull-up/pull-down
            </block>
            <control if="pin &lt;  8">
              <block>
                pos = ((pin    ) &amp; 7) * 4;
                Write32(portAdr + 0x20,    ((Read32(portAdr + 0x20) &amp; ~(15 &lt;&lt; pos))                    ) );  // GPIOx_AFRL:    Alternate Function to AF0
              </block>
            </control>
            <control if="pin &gt;= 8">
              <block>
                pos = ((pin - 8) &amp; 7) * 4;
                Write32(portAdr + 0x24,    ((Read32(portAdr + 0x24) &amp; ~(15 &lt;&lt; pos))                    ) );  // GPIOx_AFRH:    Alternate Function to AF0
              </block>
            </control>

          <control if="width &gt;= 1" info="TPIU port width 1">
            <!-- configure TRACED0 -->
            <block info="configure TRACED0">
              pin     =                          (TraceD0_Pin            ) &amp; 0x0000FFFF;
              port    =                          (TraceD0_Pin &gt;&gt; 16) &amp; 0x0000FFFF;
              portAdr = MCU_AHB4_PERIPH_BASE + (((TraceD0_Pin &gt;&gt; 4 ) &amp; 0x0000F000) + 0x00002000);

              pos = pin * 2;
              Write32(RCC_MC_AHB4ENSETR, ((Read32(RCC_MC_AHB4ENSETR)                      ) | (1 &lt;&lt; port)) );  // RCC_MC_AHB4ENSETR: IO port clock enable
              Write32(portAdr + 0x00,    ((Read32(portAdr + 0x00) &amp; ~( 3 &lt;&lt; pos)) | (2 &lt;&lt; pos )) );  // GPIOx_MODER:       Set Mode (Alternate Function)
              Write32(portAdr + 0x08,    ((Read32(portAdr + 0x08)                         ) | (3 &lt;&lt; pos )) );  // GPIOx_OSPEEDR:     Set Speed (Very High Speed)
              Write32(portAdr + 0x0C,    ((Read32(portAdr + 0x0C) &amp; ~( 3 &lt;&lt; pos))                    ) );  // GPIOx_PUPDR:       Set I/O to no pull-up/pull-down
            </block>
            <control if="pin &lt;  8">
              <block>
                pos = ((pin    ) &amp; 7) * 4;
                Write32(portAdr + 0x20,    ((Read32(portAdr + 0x20) &amp; ~(15 &lt;&lt; pos))                    ) );  // GPIOx_AFRL:    Alternate Function to AF0
              </block>
            </control>
            <control if="pin &gt;= 8">
              <block>
                pos = ((pin - 8) &amp; 7) * 4;
                Write32(portAdr + 0x24,    ((Read32(portAdr + 0x24) &amp; ~(15 &lt;&lt; pos))                    ) );  // GPIOx_AFRH:    Alternate Function to AF0
              </block>
            </control>
          </control>

          <control if="width &gt;= 2" info="TPIU port width 2">
            <!-- configure TRACED1 -->
            <block info="configure TRACED1">
              pin     =                          (TraceD1_Pin            ) &amp; 0x0000FFFF;
              port    =                          (TraceD1_Pin &gt;&gt; 16) &amp; 0x0000FFFF;
              portAdr = MCU_AHB4_PERIPH_BASE + (((TraceD1_Pin &gt;&gt; 4 ) &amp; 0x0000F000) + 0x00002000);

              pos = pin * 2;
              Write32(RCC_MC_AHB4ENSETR, ((Read32(RCC_MC_AHB4ENSETR)                      ) | (1 &lt;&lt; port)) );  // RCC_MC_AHB4ENSETR: IO port clock enable
              Write32(portAdr + 0x00,    ((Read32(portAdr + 0x00) &amp; ~( 3 &lt;&lt; pos)) | (2 &lt;&lt; pos )) );  // GPIOx_MODER:       Set Mode (Alternate Function)
              Write32(portAdr + 0x08,    ((Read32(portAdr + 0x08)                         ) | (3 &lt;&lt; pos )) );  // GPIOx_OSPEEDR:     Set Speed (Very High Speed)
              Write32(portAdr + 0x0C,    ((Read32(portAdr + 0x0C) &amp; ~( 3 &lt;&lt; pos))                    ) );  // GPIOx_PUPDR:       Set I/O to no pull-up/pull-down
            </block>
            <control if="pin &lt;  8">
              <block>
                pos = ((pin    ) &amp; 7) * 4;
                Write32(portAdr + 0x20,    ((Read32(portAdr + 0x20) &amp; ~(15 &lt;&lt; pos))                    ) );  // GPIOx_AFRL:      Alternate Function to AF0
              </block>
            </control>
            <control if="pin &gt;= 8">
              <block>
                pos = ((pin - 8) &amp; 7) * 4;
                Write32(portAdr + 0x24,    ((Read32(portAdr + 0x24) &amp; ~(15 &lt;&lt; pos))                    ) );  // GPIOx_AFRH:      Alternate Function to AF0
              </block>
            </control>
          </control>

          <control if="width &gt;= 4" info="TPIU port width 4">
            <!-- configure TRACED2 -->
            <block info="configure TRACED2">
              pin     =                          (TraceD2_Pin            ) &amp; 0x0000FFFF;
              port    =                          (TraceD2_Pin &gt;&gt; 16) &amp; 0x0000FFFF;
              portAdr = MCU_AHB4_PERIPH_BASE + (((TraceD2_Pin &gt;&gt; 4 ) &amp; 0x0000F000) + 0x00002000);

              pos = pin * 2;
              Write32(RCC_MC_AHB4ENSETR, ((Read32(RCC_MC_AHB4ENSETR)                      ) | (1 &lt;&lt; port)) );  // RCC_MC_AHB4ENSETR: IO port clock enable
              Write32(portAdr + 0x00,    ((Read32(portAdr + 0x00) &amp; ~( 3 &lt;&lt; pos)) | (2 &lt;&lt; pos )) );  // GPIOx_MODER:       Set Mode (Alternate Function)
              Write32(portAdr + 0x08,    ((Read32(portAdr + 0x08)                         ) | (3 &lt;&lt; pos )) );  // GPIOx_OSPEEDR:     Set Speed (Very High Speed)
              Write32(portAdr + 0x0C,    ((Read32(portAdr + 0x0C) &amp; ~( 3 &lt;&lt; pos))                    ) );  // GPIOx_PUPDR:       Set I/O to no pull-up/pull-down
            </block>
            <control if="pin &lt;  8">
              <block>
                pos = ((pin    ) &amp; 7) * 4;
                Write32(portAdr + 0x20,    ((Read32(portAdr + 0x20) &amp; ~(15 &lt;&lt; pos))                    ) );  // GPIOx_AFRL:      Alternate Function to AF0
              </block>
            </control>
            <control if="pin &gt;= 8">
              <block>
                pos = ((pin - 8) &amp; 7) * 4;
                Write32(portAdr + 0x24,    ((Read32(portAdr + 0x24) &amp; ~(15 &lt;&lt; pos))                    ) );  // GPIOx_AFRH:      Alternate Function to AF0
              </block>
            </control>

            <!-- configure TRACED3 -->
            <block info="configure TRACED3">
              pin     =                          (TraceD3_Pin            ) &amp; 0x0000FFFF;
              port    =                          (TraceD3_Pin &gt;&gt; 16) &amp; 0x0000FFFF;
              portAdr = MCU_AHB4_PERIPH_BASE + (((TraceD3_Pin &gt;&gt; 4 ) &amp; 0x0000F000) + 0x00002000);

              pos = pin * 2;
              Write32(RCC_MC_AHB4ENSETR, ((Read32(RCC_MC_AHB4ENSETR)                      ) | (1 &lt;&lt; port)) );  // RCC_MC_AHB4ENSETR: IO port clock enable
              Write32(portAdr + 0x00,    ((Read32(portAdr + 0x00) &amp; ~( 3 &lt;&lt; pos)) | (2 &lt;&lt; pos )) );  // GPIOx_MODER:       Set Mode (Alternate Function)
              Write32(portAdr + 0x08,    ((Read32(portAdr + 0x08)                         ) | (3 &lt;&lt; pos )) );  // GPIOx_OSPEEDR:     Set Speed (Very High Speed)
              Write32(portAdr + 0x0C,    ((Read32(portAdr + 0x0C) &amp; ~( 3 &lt;&lt; pos))                    ) );  // GPIOx_PUPDR:       Set I/O to no pull-up/pull-down
            </block>
            <control if="pin &lt;  8">
              <block>
                pos = ((pin    ) &amp; 7) * 4;
                Write32(portAdr + 0x20,    ((Read32(portAdr + 0x20) &amp; ~(15 &lt;&lt; pos))                    ) );  // GPIOx_AFRL:      Alternate Function to AF0
              </block>
            </control>
            <control if="pin &gt;= 8">
              <block>
                pos = ((pin - 8) &amp; 7) * 4;
                Write32(portAdr + 0x24,    ((Read32(portAdr + 0x24) &amp; ~(15 &lt;&lt; pos))                    ) );  // GPIOx_AFRH:      Alternate Function to AF0
              </block>
            </control>
          </control>
        </sequence>

