mdhardenburgh/Blinky/Packages/.cache/Keil.STM32MP1xx_DFP.1.1.0.pdsc
  </conditions>

  <components>
    <!-- Startup -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="STM32MP157 M4 CMSIS">
      <description>System Startup for STMicroelectronics STM32MP157 Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_DEVICE_STARTUP_STM32MP157    /* Device Startup for STM32MP157 */
      </RTE_Components_h>

      <files>
        <file category="include"      name="Drivers/CMSIS/Device/ST/STM32MP1xx/Include/"/>
        <file category="source"       name="Drivers/CMSIS/Device/ST/STM32MP1xx/Source/Templates/system_stm32mp1xx.c"                version="1.0.0" attr="config"/>
        <file category="header"       name="MDK/Templates/stm32mp1xx_hal_conf.h"                                                    version="1.0.0" attr="config"/>
        <file category="header"       name="Drivers/STM32MP1xx_HAL_Driver/Inc/stm32mp1xx_hal.h"/>
        <file category="source"       name="MDK/Device/Source/ARM/startup_stm32mp15xx.s"                                            version="1.0.0" attr="config" condition="ARMCC"/>
        <file category="linkerScript" name="MDK/Device/Source/ARM/linker/stm32mp15xx_m4_sram.sct"                                   version="1.0.0" attr="config" condition="ARMCC"/>
        <file category="source"       name="Drivers/CMSIS/Device/ST/STM32MP1xx/Source/Templates/gcc/startup_stm32mp15xx.s"          version="1.0.0" attr="config" condition="GCC"/>
        <file category="linkerScript" name="Drivers/CMSIS/Device/ST/STM32MP1xx/Source/Templates/gcc/linker/stm32mp15xx_m4.ld"       version="1.0.0" attr="config" condition="GCC"/>
        <file category="source"       name="Drivers/CMSIS/Device/ST/STM32MP1xx/Source/Templates/iar/startup_stm32mp15xx.s"          version="1.0.0" attr="config" condition="IAR"/>
        <file category="linkerScript" name="Drivers/CMSIS/Device/ST/STM32MP1xx/Source/Templates/iar/linker/stm32mp15xx_sram.icf"    version="1.0.0" attr="config" condition="IAR"/>

        <!-- Templates -->
        <file category="source"       name="Projects/STM32MP157C-EV1/Templates/Src/main.c"                                          attr="template" select="Main file"/>
        <file category="header"       name="Projects/STM32MP157C-EV1/Templates/Inc/main.h"                                          attr="template" select="Main file"/>
        <file category="source"       name="Projects/STM32MP157C-EV1/Templates/Src/stm32mp1xx_it.c"                                 attr="template" select="Exception Handlers and Peripheral IRQ"/>
        <file category="header"       name="Projects/STM32MP157C-EV1/Templates/Inc/stm32mp1xx_it.h"                                 attr="template" select="Exception Handlers and Peripheral IRQ"/>
        <file category="source"       name="Projects/STM32MP157C-EV1/Templates/Src/lock_resource.c"                                 attr="template" select="Lock Resource"/>
        <file category="header"       name="Projects/STM32MP157C-EV1/Templates/Inc/lock_resource.h"                                 attr="template" select="Lock Resource"/>
        <file category="source"       name="Projects/STM32MP157C-EV1/Templates/Src/stm32mp1xx_hal_msp.c"                            attr="template" select="MCU Support Package"/>

        <!-- Configuration of shell scripts for production mode -->
        <file category="utility"      name="Tools/production.config"                                                                version="1.0.0" attr="config"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="STM32MP157 A7 CMSIS">
      <description>System Startup for STMicroelectronics STM32MP157 Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_DEVICE_STARTUP_STM32MP157_A7    /* Device Startup for STM32MP157 */
      </RTE_Components_h>

      <files>
        <file category="include"      name="Drivers/CMSIS/Device/ST/STM32MP1xx/Include/"/>
        <file category="include"      name="MDK/Device/Include/"/>
        <file category="header"       name="Drivers/STM32MP1xx_HAL_Driver/Inc/stm32mp1xx_hal.h"/>
        <file category="header"       name="MDK/Templates/stm32mp1xx_hal_conf.h"                                                    version="1.0.0" attr="config"/>
        <file category="source"       name="MDK/Device/Source/system_stm32mp15xx_A7.c"                                              version="1.0.0" attr="config"/>
        <file category="source"       name="MDK/Device/Source/mmu_stm32mp15xx.c"                                                    version="1.0.0" attr="config" condition="ARMCC"/>
        <file category="source"       name="MDK/Device/Source/ARM/startup_stm32mp15xx_A7.c"                                         version="1.0.0" attr="config" condition="ARMCC"/>
        <file category="linkerScript" name="MDK/Device/Source/ARM/linker/stm32mp15xx_A7.sct"                                        version="1.0.0" attr="config" condition="ARMCC"/>
        <file category="header"       name="MDK/Device/Include/mem_stm32mp15xx.h"                                                   version="1.0.0" attr="config"/>

        <!-- Templates -->
        <file category="source"       name="Projects/STM32MP157C-EV1/Templates/Src/main.c"                                          attr="template" select="Main file"/>
        <file category="header"       name="Projects/STM32MP157C-EV1/Templates/Inc/main.h"                                          attr="template" select="Main file"/>
        <file category="source"       name="Projects/STM32MP157C-EV1/Templates/Src/lock_resource.c"                                 attr="template" select="Lock Resource"/>
        <file category="header"       name="Projects/STM32MP157C-EV1/Templates/Inc/lock_resource.h"                                 attr="template" select="Lock Resource"/>
      </files>
    </component>

    <!-- STMicroelectronics STM32MP157 HAL -->
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="ADC" Cversion="1.0.0" condition="STM32MP157 HAL Common">
      <description>Analog-to-digital converter (ADC) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_ADC
      </RTE_Components_h>
      <files>
        <file category="source"  name="Drivers/STM32MP1xx_HAL_Driver/Src/stm32mp1xx_hal_adc.c"/>
        <file category="source"  name="Drivers/STM32MP1xx_HAL_Driver/Src/stm32mp1xx_hal_adc_ex.c"/>
     </files>
    </component>

    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="CEC" Cversion="1.0.0" condition="STM32MP157 HAL Common">
      <description>Consumer Electronics Control (CEC) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_CEC
      </RTE_Components_h>
      <files>
        <file category="source"  name="Drivers/STM32MP1xx_HAL_Driver/Src/stm32mp1xx_hal_cec.c"/>
     </files>
    </component>

