mdhardenburgh/Blinky/Packages/.cache/Keil.STM32MP1xx_DFP.1.1.0.pdsc
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common" Cversion="1.0.0" condition="STM32MP157 HAL Common">
      <description>Common HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_COMMON
      </RTE_Components_h>
      <files>
        <file category="include" name="Drivers/STM32MP1xx_HAL_Driver/Inc/"/>
        <file category="source"  name="Drivers/STM32MP1xx_HAL_Driver/Src/stm32mp1xx_hal.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="Cortex" Cversion="1.0.0" condition="STM32MP157 HAL Common">
      <description>Cortex HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_CORTEX
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32MP1xx_HAL_Driver/Src/stm32mp1xx_hal_cortex.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="CRC" Cversion="1.0.0" condition="STM32MP157 HAL Common">
      <description>CRC calculation unit (CRC) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_CRC
      </RTE_Components_h>
      <files>
        <file category="source"  name="Drivers/STM32MP1xx_HAL_Driver/Src/stm32mp1xx_hal_crc.c"/>
        <file category="source"  name="Drivers/STM32MP1xx_HAL_Driver/Src/stm32mp1xx_hal_crc_ex.c"/>
     </files>
    </component>

    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="CRYP" Cversion="1.0.0" condition="STM32MP157 HAL Common">
      <description>Cryptographic processor (CRYP) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_CRYP
      </RTE_Components_h>
      <files>
        <file category="source"  name="Drivers/STM32MP1xx_HAL_Driver/Src/stm32mp1xx_hal_cryp.c"/>
        <file category="source"  name="Drivers/STM32MP1xx_HAL_Driver/Src/stm32mp1xx_hal_cryp_ex.c"/>
     </files>
    </component>

    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="DAC" Cversion="1.0.0" condition="STM32MP157 HAL Common">
      <description>Digital-to-analog converter (DAC) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_DAC
      </RTE_Components_h>
      <files>
        <file category="source"  name="Drivers/STM32MP1xx_HAL_Driver/Src/stm32mp1xx_hal_dac.c"/>
        <file category="source"  name="Drivers/STM32MP1xx_HAL_Driver/Src/stm32mp1xx_hal_dac_ex.c"/>
     </files>
    </component>

    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="DCMI" Cversion="1.0.0" condition="STM32MP157 HAL Common">
      <description>Digital camera interface (DCMI) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_DCMI
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32MP1xx_HAL_Driver/Src/stm32mp1xx_hal_dcmi.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="DFSDM" Cversion="1.0.0" condition="STM32MP157 HAL Common">
      <description>Digital Filter for Sigma-Delta Modulators (DFSDM) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_DFSDM
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32MP1xx_HAL_Driver/Src/stm32mp1xx_hal_dfsdm.c"/>
        <file category="source" name="Drivers/STM32MP1xx_HAL_Driver/Src/stm32mp1xx_hal_dfsdm_ex.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA" Cversion="1.0.0" condition="STM32MP157 HAL Common">
      <description>DMA controller (DMA) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_DMA
      </RTE_Components_h>
      <files>
        <file category="source"  name="Drivers/STM32MP1xx_HAL_Driver/Src/stm32mp1xx_hal_dma.c"/>
        <file category="source"  name="Drivers/STM32MP1xx_HAL_Driver/Src/stm32mp1xx_hal_dma_ex.c"/>
     </files>
    </component>

    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="EXTI" Cversion="1.0.0" condition="STM32MP157 HAL Common">
      <description>External Interrupts (EXTI) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_EXTI
      </RTE_Components_h>
      <files>
        <file category="source"  name="Drivers/STM32MP1xx_HAL_Driver/Src/stm32mp1xx_hal_exti.c"/>
     </files>
    </component>

    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="FDCAN" Cversion="1.0.0" condition="STM32MP157 HAL Common">
      <description>Flexible DataRate Controller Area Network (FDCAN) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_FDCAN
      </RTE_Components_h>
      <files>
        <file category="source"  name="Drivers/STM32MP1xx_HAL_Driver/Src/stm32mp1xx_hal_fdcan.c"/>
     </files>
    </component>

    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO" Cversion="1.0.0" condition="STM32MP157 HAL Common">
      <description>General-purpose I/O (GPIO) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_GPIO
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32MP1xx_HAL_Driver/Src/stm32mp1xx_hal_gpio.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="HASH" Cversion="1.0.0" condition="STM32MP157 HAL Common">
      <description>Hash processor (HASH) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_HASH
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32MP1xx_HAL_Driver/Src/stm32mp1xx_hal_hash.c"/>
        <file category="source" name="Drivers/STM32MP1xx_HAL_Driver/Src/stm32mp1xx_hal_hash_ex.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="HSEM" Cversion="1.0.0" condition="STM32MP157 HAL Common">
      <description>Hardware semaphore (HSEM) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_HSEM
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32MP1xx_HAL_Driver/Src/stm32mp1xx_hal_hsem.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="I2C" Cversion="1.0.0" condition="STM32MP157 HAL Common">
      <description>Inter-integrated circuit (I2C) interface HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_I2C
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32MP1xx_HAL_Driver/Src/stm32mp1xx_hal_i2c.c"/>
        <file category="source" name="Drivers/STM32MP1xx_HAL_Driver/Src/stm32mp1xx_hal_i2c_ex.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="IPCC" Cversion="1.0.0" condition="STM32MP157 HAL Common">
      <description>Interprocessor Communication I/O (IPCC) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_IPCC
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32MP1xx_HAL_Driver/Src/stm32mp1xx_hal_ipcc.c"/>
      </files>
    </component>

