mdhardenburgh/Blinky/Packages/.cache/Keil.STM32MP1xx_DFP.1.1.0.pdsc
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="USART" Cversion="1.0.0" condition="STM32MP157 HAL Common">
      <description>Universal synchronous asynchronous receiver transmitter (USART) driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_USART
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32MP1xx_HAL_Driver/Src/stm32mp1xx_hal_usart.c"/>
        <file category="source" name="Drivers/STM32MP1xx_HAL_Driver/Src/stm32mp1xx_hal_usart_ex.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="WWDG" Cversion="1.0.0" condition="STM32MP157 HAL Common">
      <description>Window watchdog (WWDG) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_WWDG
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32MP1xx_HAL_Driver/Src/stm32mp1xx_hal_wwdg.c"/>
      </files>
    </component>

    <!-- Board Support -->
    <bundle Cbundle="STM32MP157C-EV1" Cclass="Board Support" Cversion="1.0.0">
      <description>STM32MP157C-EV1 Evaluation Board</description>
      <doc></doc>
        <component Cgroup="BSP" condition="STM32MP157 HAL GPIO">
          <description>Board specific settings for hardware initialization</description>
          <files>
            <file category="include" name="Drivers/BSP/STM32MP15xx_EVAL/"/>
            <file category="source"  name="Drivers/BSP/STM32MP15xx_EVAL/stm32mp15xx_eval.c"/>
            <file category="header"  name="MDK/Templates/stm32mp15xx_eval_conf.h" version="1.0.0" attr="config"/>
          </files>
        </component>
        <component Cgroup="LED" Capiversion="1.0.0" condition="STM32MP157 HAL GPIO BSP">
          <description>LED Interface</description>
          <files>
            <file category="source" name="MDK/Boards/ST/STM32MP157C-EV1/Common/LED_STM32MP157C-EV1.c"/>
          </files>
        </component>
        <component Cgroup="Buttons" Capiversion="1.0.0" condition="STM32MP157 HAL GPIO BSP">
          <description>Buttons Interface</description>
          <files>
            <file category="source" name="MDK/Boards/ST/STM32MP157C-EV1/Common/Buttons_STM32MP157C-EV1.c"/>
          </files>
        </component>
    </bundle>

    <bundle Cbundle="STM32MP157C-DK2" Cclass="Board Support" Cversion="1.0.0">
      <description>STM32MP157C-DK2 Discovery Kit</description>
      <doc></doc>
        <component Cgroup="BSP" condition="STM32MP157 HAL GPIO">
          <description>Board specific settings for hardware initialization</description>
          <files>
            <file category="include" name="Drivers/BSP/STM32MP15xx_DISCO/"/>
            <file category="source"  name="Drivers/BSP/STM32MP15xx_DISCO/stm32mp15xx_disco.c"/>
            <file category="header"  name="MDK/Templates/stm32mp15xx_disco_conf.h" version="1.0.0" attr="config"/>
          </files>
        </component>
        <component Cgroup="LED" Capiversion="1.0.0" condition="STM32MP157 HAL GPIO BSP">
          <description>LED Interface</description>
          <files>
            <file category="source" name="MDK/Boards/ST/STM32MP157C-DK2/Common/LED_STM32MP157C-DK2.c"/>
          </files>
        </component>
        <component Cgroup="Buttons" Capiversion="1.0.0" condition="STM32MP157 HAL GPIO BSP">
          <description>Buttons Interface</description>
          <files>
            <file category="source" name="MDK/Boards/ST/STM32MP157C-DK2/Common/Buttons_STM32MP157C-DK2.c"/>
          </files>
        </component>
    </bundle>
  </components>

  <boards>
    <!-- Board description -->
    <board name="STM32MP157C-EV1" vendor="STMicroelectronics" revision="Rev C" orderForm="https://www.st.com/content/st_com/en/products/evaluation-tools/product-evaluation-tools/mcu-mpu-eval-tools/stm32-mcu-mpu-eval-tools/stm32-eval-boards/stm32mp157c-ev1.html#samplebuy-scroll">
      <description>STM32MPU Evaluation Board</description>
      <image small="MDK/Boards/ST/STM32MP157C-EV1/Documentation/stm32mp157c-ev1_small.jpg" large="MDK/Boards/ST/STM32MP157C-EV1/Documentation/stm32mp157c-ev1_large.jpg"/>
      <mountedDevice deviceIndex="0" Dvendor="STMicroelectronics:13" Dname="STM32MP157CAA"/>
      <compatibleDevice deviceIndex="0" Dvendor="STMicroelectronics:13" Dname="STM32MP157*"/>
      <book category="overview"  name="https://www.st.com/content/st_com/en/products/evaluation-tools/product-evaluation-tools/mcu-mpu-eval-tools/stm32-mcu-mpu-eval-tools/stm32-eval-boards/stm32mp157c-ev1.html" title="STM32MP157C-EV1 Evaluation board with STM32MP157C MPU"/>
      <book category="manual"    name="https://www.st.com/resource/en/user_manual/dm00591370.pdf" title="STM32MP157C-EV1 User Manual"/>
      <book category="schematic" name="https://www.st.com/resource/en/schematic_pack/mb1230-c_schematic.pdf" title="MB1230-C Board Schematic"/>
      <book category="schematic" name="https://www.st.com/resource/en/schematic_pack/mb1262-c01_schematic.pdf" title="MB1262-C01 Board Schematic"/>
      <book category="schematic" name="https://www.st.com/resource/en/schematic_pack/mb1263-c01_schematic.pdf" title="MB1263-C01 Board schematic"/>
      <book category="schematic" name="https://www.st.com/resource/en/schematic_pack/mb1379-a01_schematic.pdf" title="MB1379-A01 Board Schematic"/>
      <feature type="ODbg"            n="1"              name="On-board ST-Link V2-1 Debugger"/>
      <feature type="XTAL"            n="24000000"/>
      <feature type="PWR"             n="5" m="5"        name="External Supply"/>
      <feature type="RAM"             n="2"              name="4GBit DDR3L, 16bits, 533MHz"/>
      <feature type="ROM"             n="2"              name="512Mbit QSPI Flash"/>
      <feature type="ROM"             n="1"              name="32Gbit eMMC v5.0"/>
      <feature type="ROM"             n="1"              name="8Gbit SLC NAND, 8 bits, 8bit ECC, 4KB PS"/>
      <feature type="USB"             n="4"              name="USB Host Type A"/>
      <feature type="USB"             n="1"              name="USB OTG HS Micro AB"/>
      <feature type="ETH"             n="1"              name="10/100 Ethernet Port"/>
      <feature type="CAN"             n="1"              name="CAN FD"/>
      <feature type="GLCD"            n="1" m="720.1280" name="5.5 inches TFT with LED backlight, MIPI DSI interface and capacitive touch panel"/>
      <feature type="LineIn"          n="1"              name="Stereo audio codec with Headset jack"/>
      <feature type="LineOut"         n="1"              name="Stereo audio codec with Speaker jack"/>
      <feature type="MemCard"         n="1"              name="MicroSD Card connector"/>
      <feature type="Camera"          n="1"              name="5 Megapixel, 8-bit Camera"/>
      <feature type="ConnOther"       n="1"              name="Camera interface connector"/>
      <feature type="ConnOther"       n="1"              name="SPDIF RCA input and output"/>
      <feature type="ConnOther"       n="1"              name="LTDC"/>
      <feature type="ConnOther"       n="2"              name="Extension headers"/>
      <feature type="Button"          n="2"              name="User Push-Buttons"/>
      <feature type="LED"             n="4"              name="User LEDs"/>
      <debugInterface adapter="JTAG/SW" connector="20 pin JTAG (0.1 inch connector)"/>
      <debugInterface adapter="JTAG/SW" connector="ETM Trace Mictor-38 connector "/>
      <debugInterface adapter="ST-Link" connector="Micro-USB"/>
    </board>

    <board name="STM32MP157C-DK2" vendor="STMicroelectronics" revision="Rev C" orderForm="https://www.st.com/content/st_com/en/products/evaluation-tools/product-evaluation-tools/mcu-mpu-eval-tools/stm32-mcu-mpu-eval-tools/stm32-eval-boards/stm32mp157c-ev1.html#samplebuy-scroll">
      <description>STM32MPU Discovery Kit</description>
      <image small="MDK/Boards/ST/STM32MP157C-DK2/Documentation/stm32mp157c-dk2_small.jpg" large="MDK/Boards/ST/STM32MP157C-DK2/Documentation/stm32mp157c-dk2_large.jpg"/>
      <mountedDevice deviceIndex="0" Dvendor="STMicroelectronics:13" Dname="STM32MP157CAA"/>
      <compatibleDevice deviceIndex="0" Dvendor="STMicroelectronics:13" Dname="STM32MP157*"/>
      <book category="overview"  name="https://www.st.com/content/st_com/en/products/evaluation-tools/product-evaluation-tools/mcu-mpu-eval-tools/stm32-mcu-mpu-eval-tools/stm32-discovery-kits/stm32mp157c-dk2.html" title="STM32MP157C-DK2 Discovery kit with STM32MP157C MPU"/>
      <book category="manual"    name="https://www.st.com/resource/en/user_manual/dm00591354.pdf" title="STM32MP157C-DK2 User Manual"/>
      <book category="schematic" name="https://www.st.com/resource/en/schematic_pack/mb1272-dk2-c01_schematic.pdf" title="MB1272-C01 Board Schematic"/>
      <feature type="ODbg"            n="1"              name="On-board ST-Link V2-1 Debugger"/>
      <feature type="XTAL"            n="24000000"/>
      <feature type="PWR"             n="5" m="5"        name="External Supply"/>
      <feature type="RAM"             n="1"              name="4GBit DDR3L, 16bits, 533MHz"/>
      <feature type="USB"             n="4"              name="USB Host Type A"/>
      <feature type="USB"             n="1"              name="USB Type-C DRP"/>
      <feature type="ETH"             n="1"              name="10/100 Ethernet Port"/>
      <feature type="GLCD"            n="1" m="480.800"  name="4 inches TFT with LED backlight, MIPI DSI interface and capacitive touch panel"/>
      <feature type="LineIn"          n="1"              name="Stereo audio codec with Headset jack"/>
      <feature type="MemCard"         n="1"              name="MicroSD Card connector"/>
      <feature type="ConnOther"       n="1"              name="HDMI"/>
      <feature type="ConnOther"       n="1"              name="GPIO expansion connector (Raspberry Pi shields capability"/>
      <feature type="ConnOther"       n="1"              name="Arduino Uno V3 expansion connector"/>
      <feature type="Button"          n="2"              name="User Push-Buttons"/>
      <feature type="LED"             n="4"              name="User LEDs"/>
      <feature type="Other"           n="1"              name="Wifi 802.11b/g/n"/>
      <feature type="Other"           n="1"              name="Bluetooth Low Energy 4.1"/>
      <debugInterface adapter="ST-Link" connector="Micro-USB"/>
    </board>
  </boards>

  <examples>
    <!-- STM32MP157C-EV1 Board -->
    <example name="CMSIS-RTOS2 Blinky" doc="Abstract.txt" folder="MDK/Boards/ST/STM32MP157C-EV1/Blinky">
      <description>CMSIS-RTOS2 Blinky example</description>
      <board name="STM32MP157C-EV1" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

